<a href="https://colab.research.google.com/github/RaHuL-J31/Python-For-DS-and-ML/blob/master/03_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas
## built on top of NumPy
## Work on wide varity of data
## conda install pandas or pip

# Series

In [ ]:
import pandas as pd

In [ ]:
import numpy as np

In [ ]:
lables = ['q','w','e']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':3}

In [ ]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [ ]:
#in numpy you cant change index in Pandas you can 
pd.Series(data = my_data, index = lables)

q    10
w    20
e    30
dtype: int64

In [ ]:
pd.Series(my_data,lables)

q    10
w    20
e    30
dtype: int64

In [ ]:
pd.Series(d)

a    10
b    20
c     3
dtype: int64

In [ ]:
ser1 = pd.Series([1,2,3,4],['USA','India','UAE','Japan'])
ser1

USA      1
India    2
UAE      3
Japan    4
dtype: int64

In [ ]:
ser2 = pd.Series([1,2,5,4],['USA','India','UAE','Japan'])
ser2

USA      1
India    2
UAE      5
Japan    4
dtype: int64

In [ ]:
ser1['USA']

1

In [ ]:
r = "aas jjh"
type(r)

str

# DataFrames

In [ ]:
from numpy.random import randn

In [ ]:
np.random.seed(101)

In [ ]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [ ]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y',"z"])

In [ ]:
df

          W         X         Y         z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [ ]:
df[['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [ ]:
df['new'] = df['W'] + df['Y']

In [ ]:
df

          W         X         Y         z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [ ]:
df.drop('new',axis=1)

          W         X         Y         z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df
#stilll new is available so we need to use Inplace method

          W         X         Y         z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [ ]:
df.drop('new',axis=1,inplace=True)
#now dropped permenantly

In [ ]:
df

          W         X         Y         z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df.drop('E',axis=0)

          W         X         Y         z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

### axis = 0 for rows 1 for colums

In [ ]:
df.shape

(5, 4)

In [ ]:
# Selecting ROWS
df.loc['C']

W    0.807706
X    0.072960
Y    0.638787
z    0.329646
Name: C, dtype: float64

In [ ]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
z    0.329646
Name: C, dtype: float64

In [ ]:
df.loc['B','Y']

0.16690463609281317

In [ ]:
df.loc[['B','C'],['X','Y']]

          X         Y
B  0.390528  0.166905
C  0.072960  0.638787

In [ ]:
df>0

       W      X      Y      z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [ ]:
boolva = df>0

In [ ]:
df[boolva]

          W         X         Y         z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [ ]:
#you can directly use
df[df>0]

          W         X         Y         z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [ ]:
df['W'] > 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [ ]:
df[df['W']>0]

          W         X         Y         z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [ ]:
df[df['W']>0].loc['C']

W    0.807706
X    0.072960
Y    0.638787
z    0.329646
Name: C, dtype: float64

In [ ]:
df[df['W']>0]['W']

A    0.302665
C    0.807706
Name: W, dtype: float64

In [ ]:
df[(df['W']<0) & (df['Y']>0)]
#need to use & insted of and
# | for OR

          W         X         Y         z
B -0.134841  0.390528  0.166905  0.184502
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df.reset_index()

  index         W         X         Y         z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [ ]:
newind = "AB CD EF GH IJ".split()
df['new'] = newind
df

          W         X         Y         z new
A  0.302665  1.693723 -1.706086 -1.159119  AB
B -0.134841  0.390528  0.166905  0.184502  CD
C  0.807706  0.072960  0.638787  0.329646  EF
D -0.497104 -0.754070 -0.943406  0.484752  GH
E -0.116773  1.901755  0.238127  1.996652  IJ

## multilevel index

In [ ]:
#index lvls
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [ ]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [ ]:
df.index.names

FrozenList([None, None])

In [ ]:
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [ ]:
df.loc['G2'].loc[2].loc['B']

-0.6102588558227414

In [ ]:
df.xs('G1')
#cross section method

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [ ]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

## Missing data

In [ ]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [ ]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()
#all row with nan value by default axis = 0 to drop column axis = 1

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [ ]:
# thresh 
df.dropna(thresh=2) 
# removes if row has 2 or more nan

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
#replace NAN
df.fillna(value="fill val")

          A         B  C
0         1         5  1
1         2  fill val  2
2  fill val  fill val  3

In [ ]:
#replace NAN
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GroupBy

In [ ]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
          'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
          'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
byComp = df.groupby('Company')
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [ ]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [ ]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

## Operations

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col2'].unique()

array([444, 555, 666])

In [ ]:
len(df['col2'].unique())

3

In [ ]:
df['col2'].nunique()

3

In [ ]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [ ]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
def times2(x):
  return x*2
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [ ]:
df['col2'].apply(lambda x : x *2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [ ]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [ ]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [ ]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Input and Output

In [ ]:
pwd

'/content'

In [ ]:
from google.colab import drive

In [ ]:
from google.colab import drive
drive.mount('/gdrive')

Mounted at /gdrive

In [ ]:
df = pd.read_csv('/gdrive/MyDrive/Colab Notebooks/example')

In [ ]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
df.to_csv('My Op',index=False)

### Excel

In [ ]:
#Pd can only import data from Excel not formula etc
df = pd.read_excel('/gdrive/MyDrive/Colab Notebooks/Excel_Sample.xlsx',sheet_name='Sheet1')

In [ ]:
df.to_excel('/gdrive/MyDrive/Colab Notebooks/Excel Op.xlsx',sheet_name='NewSheet')

### HTML

In [ ]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [ ]:
data[0].head()

                          Bank Name  ...       Closing Date
0                 Almena State Bank  ...   October 23, 2020
1        First City Bank of Florida  ...   October 16, 2020
2              The First State Bank  ...      April 3, 2020
3                Ericson State Bank  ...  February 14, 2020
4  City National Bank of New Jersey  ...   November 1, 2019

[5 rows x 6 columns]

### SQL

In [ ]:
h = 'jksjf'
h.('j')

AttributeError: ignored